{"/docs/best-practices-tools/":{"data":{"":"There are certain tools that can make your life easier while you personalize. I’ll describe each and why you might want to take some time signing up.","back-up-folder#Back-up folder":"","github#GitHub":"Plugins and patches by and large will be hosted in GitHub repositories. You can think of a repository (or repo) as a landing page for packages of code that make your device do something it doesn’t do out of the box.\nI strongly recommend creating a GitHub account so you can star repos for plugins you’re using. You can also use your GitHub account to file issues with creators of certain plugins, which alerts them of potential buggy or unexpected behavior.","vs-code-textedit-and-notepad#VS Code, TextEdit, and Notepad":""},"title":"Best practices + tooling (Optional)"},"/docs/customizing-koreader/":{"data":{"":"Okay. You installed Koreader and it looks nothing like the pictures you’ve seen online. Now what? lol well I guess it depends on what your goals are. What I can do is show you how I’ve set up Koreader.","i-prommy-ill-write-this-on-1215#I prommy I\u0026rsquo;ll write this on 12/15\u0026hellip;":""},"title":"Let's customize"},"/docs/install-koreader/":{"data":{"":"These instructions are based off the video created by @Techy-Notes on YouTube. I wanted to transcribe these procedures to preserve them, and give users more options for setting up Koreader. The doc won’t cover how to jailbreak your Kindle, nor should you assume that it’ll help you use Koreader on non-Kobo devices.","phase-1-edit-kobo-conf-file#Phase 1: Edit Kobo \u003ccode\u003e.conf\u003c/code\u003e file":"Plug in your ereader.\nGo to .kobo \u003e Kobo \u003e Kobo ereader.conf.\nOpen the .conf file in some kind of text editor (like VS Code, TextEdit, or Notepad) and add this snippet to the top of the file (Kobo will put it in the correct place when it updates):\n[FeatureSettings]\rExcludeSyncFolders=(\\\\.(?!kobo|adobe).+|([^.][^/]*/)+\\\\..+) Save, then safely eject your ereader.\nNote: I’m not sure what this step does but I’ve reached out to Techy-Notes to confirm why we do this. What I can confirm right now is that my Kobo has worked just fine with this edit.","phase-2-install-NickelMenu#Phase 2: Install NickelMenu":"Plug in your ereader.\nGo to the release page of the NickelMenu repository and download the latest release of KoboRoot.tgz.\nThe file you need is in the Assets section. I strongly recommend that you keep a copy of the most recent release handy. NickelMenu sometimes disappears as we tinker with our ereader, and the best way to get it back is to follow the NickelMenu install step. Find where KoboRoot.tgz downloaded on your PC, then copy KoboRoot.tgz and paste it into the .kobo directory.\nEject your ereader and let it update.\nLet Kobo boot up, and confirm that NickelMenu appears as a new menu item. Should be on the far right after More.\nReconnect your Kobo again (lol), then look at the root directory. Notice the new folder that has appeared in your directory called .adds: that’s good.\nOpen .adds to see a new folder named nm. Inside the nm directory, create a new file called menu (without a file extension) and paste in the following code snippet:\nexperimental :menu_main_15505_icon :/mnt/onboard/.adds/nm/.icon.png\rexperimental: menu_main_15505_label : +NM+\rmenu_item : main : Koreader+ : cmd_spawn :quiet :exec /mnt/onboard/.adds/Koreader/Koreader.sh\rmenu_item : main : Dark Mode : nickel_setting : toggle : dark_mode\rmenu_item : main : Screenshots : nickel_setting : toggle : screenshots\rmenu_item : main : Import books : nickel_misc : rescan_books_full\rmenu_item : main : Reboot : power : reboot\rmenu_item : main : Shutdown : power : shutdown\rmenu_item : main : WiFi On/Off : nickel_setting : toggle : force_wifi\rchain_success : nickel_wifi : toggle\rmenu_item : main : USB Connect : nickel_misc : force_usb_connection\r# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- #\rmenu_item : reader : Dark Mode : nickel_setting : toggle : dark_mode\rmenu_item : reader : Screenshots : nickel_setting : toggle : screenshots\rmenu_item : reader : Goodreads : nickel_browser : https://www.goodreads.com/book\rmenu_item : reader : USB Connect : nickel_misc : force_usb_connection\r# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- #\rmenu_item : library : Dark Mode : nickel_setting : toggle : dark_mode\rmenu_item : library : Screenshots : nickel_setting : toggle : screenshots\rmenu_item : library : Import books : nickel_misc : rescan_books_full\rmenu_item : library : Reboot : power : reboot\rmenu_item : library : Shutdown : power : shutdown\rmenu_item : library : WiFi On/Off : nickel_setting : toggle : force_wifi\rchain_success : nickel_wifi : toggle\rmenu_item : library : USB Connect : nickel_misc : force_usb_connection Eject safely, let your ereader update, and confirm that menu options appear by clicking the NickelMenu item on your default Kobo page.","phase-3-install-koreader#Phase 3: Install Koreader":"Plug in your ereader (lol).\nGo to the release page of the Koreader repository and download the file that corresponds with your ereader device. The files you need are located in the Assets subsection.\nIt’s a .zip file, so we need to extract its contents. Right click the .zip folder you just downloaded, and extract. A duplicate folder without the .zip file extension should appear in your working directory.\nInside that newly extracted folder, find the Koreader subdirectory, then right click copy that folder.\nPaste the folder into .adds. The directory should now look like this:\nEject your ereader and let it update, then view the fruits of your labor!","set-up-koreader-as-your-default-launcher#Set up Koreader as your default launcher":"There is a lot of ejecting, checking, then plugging in your ereader in all of these procedures. This is intentional. It helps you keep clear idea of when things stopped working.\nIf you did all these steps without ejecting your ereader once, got to the end, and things were broken, you wouldn’t really know the phase that things went south. It’s much more helpful to say “I added the file during step X and it worked. But when I completed step Y, I got this error.”\nAnyway, be kind to yourself and safely eject, check, and replug it in."},"title":"Install Koreader"},"/docs/very-beginner/":{"data":{"":"This doc is for nontechnical users wanting to personalize their Kobo ereader. If you’re someone who already had a Github account before your ereader, then go ahead and start here. If you’re still wondering what the hell GitHub is and what people mean when they refer to the root, then you’re in a good spot.","create-a-new-folder-in-kobo#Create a new folder in \u003ccode\u003e.kobo\u003c/code\u003e":"We’re going to introduce a bunch of concepts by first working on a task: creating a screensaver folder in your .kobo directory. This task is intended to give you firmer footing on how file structures work before we install Koreader, which is famously a pain in the ass.","lets-review-really-quick#Let\u0026rsquo;s review really quick":"Earlier I said that tinkering with devices is just playing with files and folders. Everything you do here on out will follow this broad procedure:\nPlug in your Kobo Either create a new folder and add some files to it, or add a folder to an existing folder, or even just edit some text in an existing file… or add a new file. You get the picture, lol. Eject your Kobo safely Wait for an update, then see the results There is a diabolical fifth step that involves troubleshooting and repeating all of these steps until you get the results you want. You will get a crash page sometimes… But the good news is Kobo is super forgiving with the DIY hacker spirit, so worry not. :)","step-1-plug-in-your-kobo-via-usb-to-your-pc#Step 1: Plug in your Kobo via USB to your PC":"First thing’s first: at the end of the day all devices are just a bunch of folders and files that you can view in your File Explorer, and your Kobo is no different. So, let’s plug it in:\nThe screenshot shows a plugged in Kobo (KOBOeReader(D:)) and all the folders that make up my Kobo’s root directory. The difference between a root directory and regular directory is that root indicates the top-most level in a file structure. Sometimes people will call something root when it’s not, so tread carefully and always clarify what folder they mean.\nAs you can see, I have a bunch of directories (or folders, but we’ll use the term directories throughout these docs) that you may or may not have. .adds is where NickelMenu and Koreader will eventually live; Books is where I keep all my epubs (which live in subdirectories by genre); .fonts is where I’ve added my own fonts; and so on.\nBut let’s ignore all that for now and move on to the second step.","step-2-create-a-folder-in-kobo#Step 2: Create a folder in \u003ccode\u003e.kobo\u003c/code\u003e":"Select .kobo to open the main Kobo directory. A bunch of stuff appears; take a look, then ignore all of it for now:\nCreate a new folder called screensaver. This is where you’ll add new images so when your Kobo is asleep or powered off, you’ll have something custom on display. Your directory should look like this:\nRe: .kobo: This is one of two directories you’ll be using quite a bit.\nGenerally speaking, making changes to the .kobo directory introduces new behaviors and ~outcomes for your default Kobo software. You may occasionally need to add something to .kobo even if you’re modifying something in Koreader, so be cognizant of what folder you’re adding shit to in future procedures.","step-3-add-an-image#Step 3. Add an image":"Find an image and add it to screensavers. A copy from the downloaded image on your PC and a paste into the new folder will do:\nI use a Kobo Libra Color, and the resolution size that gets the full screen effect is 926x1200. Don’t know what aspect ratio that is, so can’t help anyone there. As far as I can tell image titles and file extensions (that is the .png and .jpg) aren’t super important, though IIRC my Kobo didn’t load any .webp images.","step-4-safely-eject#Step 4. Safely eject":"Any time you want to test if some modification worked, you need to safely eject. To safely eject, right click on KOBOeReader (D:) and choose Eject. Don’t just unplug your device.\nYour Kobo will update, then turn on. Put your Kobo in sleep mode and the image you added should appear. :)","whats-next#What\u0026rsquo;s next?":"You have two options for the next part of your journey. You can either:\nGet an introduction to tools like VS Code, GitHub, Koreader. These aren’t prerequisites and many might see it as overkill, though I do not. In other words this doc is just my opinion and the suggestions that come from that, and won’t be recommended in any forum. Or jump right into getting started with installing Koreader."},"title":"A beginner's introduction"},"/docs/welcome/":{"data":{"":"Something I’ve noticed perusing Mobile Reads or Reddit is that nontechnical users are unfamiliar with how file management and directories work, as well as the best way to tinker with your device. I want to help in any way I can, so the goal of this site is to simplify some procedures so you can personalize your ereader.\nI think in an era where tech companies want us overly dependent on their (usually $$$, subscription-based) solutions, learning how to DIY your device into something that oozes your personality is really empowering… and not in the stupid tech world way. I think tech companies make money off us when we don’t understand how our devices work and now more than ever I believe we need to be more proactive with tinkering with our devices. ♡","my-kobo-set-up#My Kobo set up":"I’ve been reading more than I have in years thanks to my ereader. I’ve also caught the DIY, hacking bug. Here’s what my current set up looks like with Koreader (and some other plugins):\nI’ve used:\nNickelMenu to launch Koreader ProjectTitle plugin A plugin that lets me use my Nintendo Switch joycon as a page turner A few patches I’ve experimented with Custom fonts Custom screensavers for the default Kobo device and Koreader Custom icons for every menu item In the past I’ve had Wallabag, Rakuyomi, and some other plugins. I don’t use those right now, but I have gotten them to work.","who-this-site-is-for#Who this site is for":"This site is intended for nontechnical audiences, though I hope the documentation can assist users at all levels. I’ve noticed a lot of confusion with certain tasks that I believe I can simplify with some good old fashioned, non-AI generated docs. I’m a technical writer by trade, so this is right up my alley.\nI’ve tried to cite my sources when possible and I’ll try my best to maintain the docs so they’re up to date. Really, I want ereader hacking to be as accessible as possible, which means sometimes explaining concepts, making suggestions, or writing in a relatively verbose way that a developer might not need.\nIf my procedures or concepts aren’t clear, please let me know by filing a GitHub issue. If you don’t know what that means, then you will soon. ♡♡♡♡"},"title":"Welcome! ♡"}}